# Create Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
MEPAnalyticalSystem..::..Create Method
MEPAnalyticalSystem Class See Also
---
Creates a new analytical system
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public static MEPAnalyticalSystem Create(
	Document document,
	AnalyticalSystemDomain domain,
	string name
)
```

Visual Basic
---
```text
Public Shared Function Create ( _
	document As Document, _
	domain As AnalyticalSystemDomain, _
	name As String _
) As MEPAnalyticalSystem
```

Visual C++
---
```text
public:
static MEPAnalyticalSystem^ Create(
	Document^ document,
	AnalyticalSystemDomain domain,
	String^ name
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document where the new element will be created.
domain
    Type: Autodesk.Revit.DB.Mechanical..::..AnalyticalSystemDomain The domain of analytical system to be created.
name
    Type: System..::..String The name of new analytical system. The actual name may be post-fixed if already exists.
# ### Return Value
The newly created analytical system.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | name cannot include prohibited characters. -or- name is an empty string. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). |
| Autodesk.Revit.Exceptions..::..ModificationForbiddenException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process. |
| Autodesk.Revit.Exceptions..::..ModificationOutsideTransactionException | The document has no open transaction. |

# See Also
MEPAnalyticalSystem Class
Autodesk.Revit.DB.Mechanical Namespace